packages/dars/dars-1.0.0-py3-none-any.whl/dars/templates/getpublicdocsrequest223.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.example.com">
<soapenv:Header/>
<soapenv:Body>
<ns2:getPublicDocsRequest xmlns:ns2="http://zakupki.gov.ru/fz44/get-docs-mis/ws" xmlns:ns3="http://zakupki.gov.ru/oos/base/1">
{% include 'index.xml.j2' %}
<selectionParams223>
	<subsystemType>{{ context.subsystemtype }}</subsystemType>
	<periodInfo>
	{% if context.monthinfo -%}
		<monthInfo>
			<monthNumber>{{ context.monthinfo.month }}</monthNumber>
			<yearNumber>{{ context.monthinfo.year }}</yearNumber>
			<offsetTimeZone>{{ context.offsettimezone }}</offsetTimeZone>
		</monthInfo>
	{%- elif context.exactdate -%}
		<exactDate>{{ context.exactdate }}</exactDate>
	{%- else -%}
		<todayInfo>
			<fromHour>{{ context.fromhour }}</fromHour>
			<toHour>{{ context.tohour }}</toHour>
			<offsetTimeZone>{{ context.offsettimezone }}</offsetTimeZone>
		</todayInfo>
	{%- endif %}
	</periodInfo>

	{% if context.organizations -%}
	<organizations223Info>
		{%- for org in context.organizations %}
			<organization223Info>
				<inn>{{ org.inn }}</inn>
				<kpp>{{ org.kpp }}</kpp>
				{% if org.ogrn %}<ogrn>{{ org.ogrn }}</ogrn>{% endif %}
			</organization223Info>
		{%- endfor %}
	</organizations223Info>
	{%- else -%}
	<isAllOrganizations223>true</isAllOrganizations223>
	{%- endif %}
</selectionParams223>
</ns2:getPublicDocsRequest>
</soapenv:Body>
</soapenv:Envelope>
